<template>
	<div class="healthNotify-wrap">
		1111
		<el-table
			ref="tableData"
			border
			:data="tableData"
			class="fs12"
			header-row-class-name="header-row"
		>
			<el-table-column
				align="left"
				prop="msg"
				label="健康资料"
				width="600"
			></el-table-column>
		</el-table>
		<!-- <el-table :data="tableData" style="width: 100%">
			<el-table-column prop="msg" label="健康资料" width="500"></el-table-column>
			<el-table-column prop="name" label="姓名" width="180"></el-table-column>
			<el-table-column prop="address" label="地址"></el-table-column>
		</el-table>-->
	</div>
</template>

<script>
export default {
	name: "HealthNotify",
	data() {
		return {
			tableData: [
				{
					msg:
						"1.您是否曾患有或因任何胸部或呼吸问题(例如︰哮喘、支气管炎、肺结核或其他呼吸器官问题，包括流鼻血)而接受治疗？"
				},
				{
					msg:
						"2. 您是否曾患有或因任何心脏的疾病或胸口疼痛(例如︰风湿性发热、高血压、心绞痛、心脏杂音、心脏骤停)，或其他血液或血管疾病而接受治疗？"
				},
				{
					msg:
						"3. 您是否曾患有或因任何消化系统问题，肝（包括肝炎或肝炎带菌者)、胃、肠或直肠出血；任何肾、膀胱或泌尿系统疾病，包括肾石、内分泌疾病、糖尿病或甲状腺疾病而接受治疗？"
				},
				{
					msg:
						"4. 您是否曾患有或因任何精神或脑部失常或问题而影响神经系统，包括癫痫、瘫痪、痳痹、头晕、长期头痛、身体失去平衡或抽搐而接受治疗？"
				},
				{
					msg:
						"5. 您是否曾患有或因癌症或肿瘤、囊肿、肿块或其他任何赘生物而接受治疗？"
				},
				{
					msg:
						"6. 您是否曾患有或因背部、脊椎、肌肉或关节疼痛或其他疾病，痛风或其他身体残疾或任何影响视力、说话能力和听觉的疾病而接受治疗？"
				},
				{
					msg:
						"7. 您是否打算或现正、或曾于过去五年内在任何医院、诊所或医务所接受一些诊断性之检查如照X光、超声波、验血、计算机扫描、活体检视、心电图、验尿或其他身体检查(因受聘而进行之例行身体检查除外)？"
				},
				{
					msg:
						"8. 您是否打算或现正、或曾于过去五年内在任何医院、诊所或医务所接受以上各题没有提及的疾病、手术或其他医疗咨询或治疗？"
				},
				{
					msg:
						"9. 您是否曾接受、或打算接受与艾滋病、HIV抗体或任何由性接触而传染的疾病之有关辅导、医疗咨询、治疗或任何检验；或曾出现疲倦、长期腹泻或不寻常之皮肤溃伤的征状？	"
				},
				{
					msg:
						"10. 您是否曾服食导致上瘾的药品(包括但不止于鸦片衍生物、巴比妥酸盐、大麻、安非他命、迷幻剂及可卡因)或曾因饮酒，吸毒或服用药物而需接受治疗或辅导 ?"
				},
				{
					msg: "11. 您是否左手惯用者?"
				},
				{
					msg: "12. 女性适用：您现在是否怀孕？倘'是'，请填写预产期："
				},
				{
					msg:
						"13. 女性适用：您是否患有任何乳房或生殖器官的疾病，包括不正常之涂片细胞检查及月经失调？"
				},
				{
					msg:
						"14.上述问题中，如有任何答案『是』者，或有任何上述未提及的身体状况，请在以下位置注明问题号码并详述之，并请携带相关病历资料／检查报告于签约时一并提交："
				}
			]
		};
	}
};
</script>
<style lang="scss" scoped></style>
